app/controllers/albums_controller.rb

  def create
    @album = Album.new(params[:album])
    if @album.save
---
INSERT INTO `albums` (`created_at`, `updated_at`, `photoset_id`) VALUES('2010-05-29 08:51:48', '2010-05-29 08:51:48', NULL)

  def edit
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 3)

  def update
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 2)

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 3)
DELETE FROM `albums` WHERE `id` = 3