app/controllers/gifts_controller.rb

SELECT * FROM `gifts`
---
  def index
    @gifts = Gift.all

INSERT INTO `gifts` (`name`, `price`, `created_at`, `quantity`, `updated_at`, `link`, `description`, `pic`) VALUES('Une écharpe de portage', '80', '2010-05-31 19:56:16', NULL, '2010-05-31 19:56:16', 'http://www.jeportemonbebe.com/_shopping/index.php?page=shop.product_details&flypage=flypage_perso2.tpl&product_id=17&category_id=1&option=com_virtuemart&Itemid=2', 'Pour porter notre crevette.', NULL)
---
  def create
    @gift = Gift.new(params[:gift])
    if @gift.save

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)
---
  def edit_pic
    @gift = Gift.find(params[:id])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)
UPDATE `gifts` SET `pic` = 'http://www.jeportemonbebe.com/_shopping/components/com_virtuemart/show_image_in_imgtag.php?filename=ANTHRACITE__poch_4b13cf5c4b855.jpg&newxsize=146&newysize=200&fileout=', `updated_at` = '2010-05-31 20:03:32' WHERE `id` = 1
---
  def update_pic
    @gift = Gift.find(params[:id])
    @gift.pic = CGI::unescape(params[:pic])
    @gift.save

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 11)
---
  def edit
    @gift = Gift.find(params[:id])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 11)
UPDATE `gifts` SET `updated_at` = '2010-07-02 13:25:56', `description` = 'Faut bien s\'amuser un peu' WHERE `id` = 9
---
  def update
    @gift = Gift.find(params[:id])
    if @gift.update_attributes(params[:gift])

SELECT * FROM `gifts` WHERE (`gifts`.`id` = 1)
DELETE FROM `gifts` WHERE `id` = 1
---
  def destroy
    gift = Gift.find(params[:id])
    gift.destroy