app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 0, 10

  def rss
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 0, 10

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `published`, `updated_at`, `content`, `published_at`) VALUES('2010-05-28 19:37:32', 'La petite est née', NULL, '2010-05-28 19:37:32', '', NULL)

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
UPDATE `posts` SET `content` = 'C\'est un grand jour pour nous.', `updated_at` = '2010-05-28 19:41:09' WHERE `id` = 1