app/controllers/users_controller.rb

  def index
    @users = User.paginate :page => params[:page], :per_page => 20
---
SELECT * FROM `users` WHERE (LOWER(`users`.email) = 'crevette') LIMIT 1

  def show
    @user = params[:id] ? User.find(params[:id]) : @current_user
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1